index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-01 qua 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AWS Certification</title>
<meta name="author" content="JOÃO VICTOR RODRIGUES HILARIO" />
<meta name="generator" content="Org Mode" />


</head>
<body>
<div id="content" class="content">
<h1 class="title">AWS Certification</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcb66324">1. 5 Pillars</a></li>
<li><a href="#org616ec65">2. IAM(Identity and Access Management)</a>
<ul>
<li><a href="#org9ae9053">2.1. User</a></li>
<li><a href="#orga031e82">2.2. Group</a></li>
<li><a href="#org072aabb">2.3. Role</a></li>
<li><a href="#orgfb84d91">2.4. Password policy</a></li>
<li><a href="#org2169690">2.5. Policy Simulator</a></li>
<li><a href="#orga70ff45">2.6. Example policy document</a></li>
</ul>
</li>
<li><a href="#org7e90145">3. EC2 (Elastic Compute Cloud)</a>
<ul>
<li><a href="#org2fba376">3.1. Pricing Options</a>
<ul>
<li><a href="#org042c8eb">3.1.1. On demand</a></li>
<li><a href="#org20ae47f">3.1.2. Reserved</a></li>
<li><a href="#org59cc277">3.1.3. Spot</a></li>
<li><a href="#orgee5f371">3.1.4. Dedicated</a></li>
</ul>
</li>
<li><a href="#org7a63105">3.2. EBS (Elastic Block Store)</a>
<ul>
<li><a href="#org73b3958">3.2.1. Advantages</a></li>
<li><a href="#org987c3ed">3.2.2. Types</a></li>
<li><a href="#org2ee8d19">3.2.3. IOPS vs Throughput</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org20d2918">4. Whitepapers</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcb66324" class="outline-2">
<h2 id="orgcb66324"><span class="section-number-2">1.</span> 5 Pillars</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Pillar</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Operational Excellence</td>
<td class="org-left">Ability to support development, run workloads effectively and continuously improve</td>
</tr>

<tr>
<td class="org-left">Security</td>
<td class="org-left">Ability to protect data, systems and assets</td>
</tr>

<tr>
<td class="org-left">Reliabity</td>
<td class="org-left">Ability of a workload to perform its intended function correctly and consistently. Also tests</td>
</tr>

<tr>
<td class="org-left">Performance Efficiency</td>
<td class="org-left">Ability to use resources efficiently and upgrade and maintain efficiency as demands and technologies evolve</td>
</tr>

<tr>
<td class="org-left">Cost Optimization</td>
<td class="org-left">Ability to deliver at the lowest price</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org616ec65" class="outline-2">
<h2 id="org616ec65"><span class="section-number-2">2.</span> IAM(Identity and Access Management)</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Global interface to manage users, applications and services access to AWS resources.</li>
</ul>
</div>
<div id="outline-container-org9ae9053" class="outline-3">
<h3 id="org9ae9053"><span class="section-number-3">2.1.</span> User</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Possible to create users that can login on aws console or keys that can be used to access services via command line or applications.</li>
<li>It&rsquo;s possible to:
<ul class="org-ul">
<li>Create and delete users.</li>
<li>Add and remove groups from users.</li>
<li>Add and remove permissions per user basis.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga031e82" class="outline-3">
<h3 id="orga031e82"><span class="section-number-3">2.2.</span> Group</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Possible to create groups that have a set of permissions to better manage users.</li>
<li>It&rsquo;s possible to:
<ul class="org-ul">
<li>Create, delete and edit groups.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org072aabb" class="outline-3">
<h3 id="org072aabb"><span class="section-number-3">2.3.</span> Role</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Possible to create roles and assign them to users, applications and services to give them access to AWS resources.</li>
<li>It&rsquo;s possible to:
<ul class="org-ul">
<li>Create, delete and edit roles.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfb84d91" class="outline-3">
<h3 id="orgfb84d91"><span class="section-number-3">2.4.</span> Password policy</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Possible to create rules for passwords, like minimum size, special characters requirements and time to reset.
</p>
</div>
</div>
<div id="outline-container-org2169690" class="outline-3">
<h3 id="org2169690"><span class="section-number-3">2.5.</span> Policy Simulator</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Allows you to test policies for each user, group and role.</li>
<li>Useful for finding permission related issues.</li>
<li><a href="https://policysim.aws.amazon.com">Policy Simulator</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga70ff45" class="outline-3">
<h3 id="orga70ff45"><span class="section-number-3">2.6.</span> Example policy document</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #51afef;">"Version"</span>: "<span style="color: #da8548; font-weight: bold;">2012</span>-<span style="color: #da8548; font-weight: bold;">10</span>-<span style="color: #da8548; font-weight: bold;">17</span>",
    <span style="color: #51afef;">"Statement"</span>: [
        {
            <span style="color: #51afef;">"Effect"</span>: <span style="color: #98be65;">"Allow"</span>,
            <span style="color: #51afef;">"Action"</span>: <span style="color: #98be65;">"*"</span>,
            <span style="color: #51afef;">"Resource"</span>: <span style="color: #98be65;">"*"</span>
        }
    ]
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e90145" class="outline-2">
<h2 id="org7e90145"><span class="section-number-2">3.</span> EC2 (Elastic Compute Cloud)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Secure and resizable compute capacity in the cloud.</li>
<li>Like a VM in amazon&rsquo;s server.</li>
<li>Designed to be scalable.</li>
<li>Pay as you use.</li>
<li>Nothing wasted as it scales with demand.</li>
</ul>
</div>
<div id="outline-container-org2fba376" class="outline-3">
<h3 id="org2fba376"><span class="section-number-3">3.1.</span> Pricing Options</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org042c8eb" class="outline-4">
<h4 id="org042c8eb"><span class="section-number-4">3.1.1.</span> On demand</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Pay by time used.</li>
<li>Good for short-term applications or that have unpredictable workloads and cannot be interrupted.</li>
<li>Good for testing.</li>
</ul>
</div>
</div>
<div id="outline-container-org20ae47f" class="outline-4">
<h4 id="org20ae47f"><span class="section-number-4">3.1.2.</span> Reserved</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Reserve capacity, get a discount from use.</li>
<li>Good for applications with predictable usage.</li>
<li>Also good if you can pay up-front because there are discounts.</li>
<li>Types:
<ul class="org-ul">
<li>Standard Reserved Instances:
<ul class="org-ul">
<li>Fixed instance for a fixed duration.</li>
</ul></li>
<li>Convertible Reserved Instances:
<ul class="org-ul">
<li>Same as standard but allows you to change instances to others of same or greater value.</li>
</ul></li>
<li>Scheduled Reserved Instances:
<ul class="org-ul">
<li>Run applications within the time window specified.</li>
<li>Good if there are things you need to do once in a while
<ul class="org-ul">
<li>Like a phone company that needs to calculate bills at the end of each month.</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org59cc277" class="outline-4">
<h4 id="org59cc277"><span class="section-number-4">3.1.3.</span> Spot</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>Purchase unused capacity at a discount.</li>
<li>Supply and demand dictates unused capacity price.</li>
<li>You define a maximum price and while capacity price is below it your application runs, when it goes above your application is shutdown.</li>
<li>Good for applications that have flexible start and end times.</li>
<li>Also for applications that need very low prices to be feasible.</li>
<li>Also good for when you have a pontual need for large amounts of capacity.</li>
</ul>
</div>
</div>
<div id="outline-container-orgee5f371" class="outline-4">
<h4 id="orgee5f371"><span class="section-number-4">3.1.4.</span> Dedicated</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>Rent a physical server only for your use.</li>
<li>Used when you need to comply with certain licenses and regulations that disallow multi-tenancy.</li>
<li>Can be purchased on demand or be reserved.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7a63105" class="outline-3">
<h3 id="org7a63105"><span class="section-number-3">3.2.</span> EBS (Elastic Block Store)</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Storage volumes attached to EC2 instances.</li>
<li>Works as a local system disk.</li>
</ul>
</div>
<div id="outline-container-org73b3958" class="outline-4">
<h4 id="org73b3958"><span class="section-number-4">3.2.1.</span> Advantages</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>Designed for critical workloads.</li>
<li>Data is replicated to protect against hardware failure.</li>
<li>Is scalable.</li>
<li>Can change capacity and time with little to no downtime.</li>
</ul>
</div>
</div>
<div id="outline-container-org987c3ed" class="outline-4">
<h4 id="org987c3ed"><span class="section-number-4">3.2.2.</span> Types</h4>
<div class="outline-text-4" id="text-3-2-2">
</div>
<ol class="org-ol">
<li><a id="org9d08a84"></a>General purpose SSD (gp2)<br />
<div class="outline-text-5" id="text-3-2-2-1">
<ul class="org-ul">
<li>Balance between price and performance.</li>
<li>3 IOPS/GB up to 16000 IOPS per volume.</li>
<li>Volumes smaller than 1 TB can burst up to 3000 IOPS.</li>
</ul>
</div>
</li>
<li><a id="org5fdc910"></a>Provisioned IOPS SSD (io1)<br />
<div class="outline-text-5" id="text-3-2-2-2">
<ul class="org-ul">
<li>High performance and highest price.</li>
<li>50 IOPS/GB up to 64000 IOPS per volume.</li>
<li>Only option if you need more than 16000 IOPS.</li>
<li>Designed for I/O intensive applications, large databases and latency-sensitive workloads.</li>
</ul>
</div>
</li>
<li><a id="org4de57ff"></a>Provisioned IOPS SSD (io2)<br />
<div class="outline-text-5" id="text-3-2-2-3">
<ul class="org-ul">
<li>Latest generation.</li>
<li>Higher durability and more IOPS/GB.</li>
<li>99.999% durability instead of 99.9%.</li>
<li>500 IOPS instead of 50.</li>
<li>Limit still 64000.</li>
<li>Same price as io1.</li>
</ul>
</div>
</li>
<li><a id="org7b9b1e3"></a>Throughput Optimized HDD (st1)<br />
<div class="outline-text-5" id="text-3-2-2-4">
<ul class="org-ul">
<li>Low-cost HDD volume.</li>
<li>Throughput of 40 MB/s per TB.</li>
<li>Able to burst up to 250 MB/s per TB.</li>
<li>Maximum throughput of 500 MB/s per volume.</li>
<li>Cost effective way to store large amounts of data.</li>
<li>Good for frequently-accessed, throughput intensive workloads.</li>
<li>Like:
<ul class="org-ul">
<li>Big Data.</li>
<li>Log processing.</li>
<li>Data warehouses.</li>
</ul></li>
<li>Cannot be a boot volume.</li>
</ul>
</div>
</li>
<li><a id="org1f7ba8e"></a>Cold HDD (sc1)<br />
<div class="outline-text-5" id="text-3-2-2-5">
<ul class="org-ul">
<li>Lowest cost option.</li>
<li>Throughput of 12 MB/s per TB.</li>
<li>Able to burst up to 80 MB/s per TB.</li>
<li>Maximum throughput of 250 MB/s per volume.</li>
<li>Good for data that requires few scans per day.</li>
<li>Also for applications that need low costs and performance isn&rsquo;t as important.</li>
<li>Cannot be a boot volume.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org2ee8d19" class="outline-4">
<h4 id="org2ee8d19"><span class="section-number-4">3.2.3.</span> IOPS vs Throughput</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>IOPS
<ul class="org-ul">
<li>Measures the number of reads and writes per second.</li>
<li>Metric for quick transactions, low latency apps and transactional workload.</li>
<li>Measures the ability to read and write very quickly.</li>
</ul></li>
<li>Throughput
<ul class="org-ul">
<li>Measure the number of bits read or written per second.</li>
<li>Metric for large datasets, complex queries and large I/O operations.</li>
<li>Measures the ability to deal with large datasets.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org20d2918" class="outline-2">
<h2 id="org20d2918"><span class="section-number-2">4.</span> Whitepapers</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/wellarchitected/latest/framework/welcome.html?did=wp_card&amp;trk=wp_card">AWS Well Architected Framework</a></li>
<li><a href="https://docs.aws.amazon.com/whitepapers/latest/practicing-continuous-integration-continuous-delivery/welcome.html?did=wp_card&amp;trk=wp_card">Practicing Continuous Integration and Continuous Delivery on AWS</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: JOÃO VICTOR RODRIGUES HILARIO</p>
<p class="date">Created: 2021-09-01 qua 17:43</p>
</div>
</body>
</html>
